HloModule jit_multiply, entry_computation_layout={(f32[32,16]{1,0}, f32[])->f32[32,16]{1,0}}, allow_spmd_sharding_propagation_to_parameters={true,true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.5 (x.1: f32[32,16], y.2: f32[]) -> f32[32,16] {
  %x.1 = f32[32,16]{1,0} parameter(0), metadata={op_name="x"}
  %y.2 = f32[] parameter(1), metadata={op_name="y"}
  %mul.3 = f32[32,16]{1,0} broadcast(%y.2), dimensions={}, metadata={op_name="jit(multiply)/mul" source_file="/home/carlesoctav/personal/modernizing-indo-nlp/src/nn/_linear.py" source_line=55 source_end_line=55 source_column=12 source_end_column=88}
  ROOT %mul.4 = f32[32,16]{1,0} multiply(%x.1, %mul.3), metadata={op_name="jit(multiply)/mul" source_file="/home/carlesoctav/personal/modernizing-indo-nlp/src/nn/_linear.py" source_line=55 source_end_line=55 source_column=12 source_end_column=88}
}

