HloModule jit_broadcast_in_dim, entry_computation_layout={(f32[])->f32[32]{0}}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.3 (args_0_.1: f32[]) -> f32[32] {
  %args_0_.1 = f32[] parameter(0), metadata={op_name="args[0]"}
  ROOT %broadcast_in_dim.2 = f32[32]{0} broadcast(%args_0_.1), dimensions={}, metadata={op_name="jit(broadcast_in_dim)/broadcast_in_dim" source_file="/home/carlesoctav/personal/modernizing-indo-nlp/src/nn/_linear.py" source_line=59 source_end_line=59 source_column=16 source_end_column=69}
}

