HloModule jit_sqrt, entry_computation_layout={(f32[])->f32[]}, allow_spmd_sharding_propagation_to_parameters={true}, allow_spmd_sharding_propagation_to_output={true}

ENTRY %main.3 (x.1: f32[]) -> f32[] {
  %x.1 = f32[] parameter(0), metadata={op_name="x"}
  ROOT %sqrt.2 = f32[] sqrt(%x.1), metadata={op_name="jit(sqrt)/sqrt" source_file="/home/carlesoctav/personal/modernizing-indo-nlp/src/nn/_linear.py" source_line=55 source_end_line=55 source_column=12 source_end_column=88}
}

